In [2]:
import pandas as pd 
import numpy as np

In [9]:
serie = pd.Series([4,7,5,3])
print(serie)
print("Valores", serie.values)
print("Índices", serie.index)
print(serie[2])

0    4
1    7
2    5
3    3
dtype: int64
Valores [4 7 5 3]
Índices RangeIndex(start=0, stop=4, step=1)
5

In [18]:
ser2 = pd.Series([4,7,-5,3], index=['d','b','a','c'])
print(ser2)
print(ser2.index)
print(ser2['a'])
ser2['a'] = 6
print(ser2[['c','a','d']])

d    4
b    7
a   -5
c    3
dtype: int64
Index(['d', 'b', 'a', 'c'], dtype='object')
-5
c    3
a    6
d    4
dtype: int64

In [20]:
print(ser2[ser2 > 3])
print(ser2 * 2)
print(ser2)

d    4
b    7
a    6
dtype: int64
d     8
b    14
a    12
c     6
dtype: int64
d    4
b    7
a    6
c    3
dtype: int64

In [21]:
'b' in ser2

True

In [22]:
sdata = {'Ohio':3500, 'Texas':7100, 'Oregon':1600, 'Utha':5000}
ser3 = pd.Series(sdata)
ser3

Ohio      3500
Texas     7100
Oregon    1600
Utha      5000
dtype: int64

In [24]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
ser4 = pd.Series(sdata, index=states)
ser4

California       NaN
Ohio          3500.0
Oregon        1600.0
Texas         7100.0
dtype: float64

In [27]:
pd.isnull(ser4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notnull(ser4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
ser3 + ser4

California        NaN
Ohio           7000.0
Oregon         3200.0
Texas         14200.0
Utha              NaN
dtype: float64

In [31]:
ser4.name = 'population'
ser4.index.name = 'state'
ser4

state
California       NaN
Ohio          3500.0
Oregon        1600.0
Texas         7100.0
Name: population, dtype: float64

In [33]:
# Dataframe

data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

frame1 = pd.DataFrame(data)
frame1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
frame1.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [35]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [37]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [41]:
frame2.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [42]:
frame2['debt'] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [52]:
frame2['debt'] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [56]:
val = pd.Series([-1.2,-1.5,-1.7], index=[2,4,5])
frame2['debt'] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [57]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [58]:
del frame2['eastern']
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [59]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [60]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [61]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [62]:
serie = pd.Series([4.5,7.2,-5.3,3.6], index=['d', 'b', 'a', 'c'])
serie

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [63]:
ser2 = serie.reindex(['a', 'b', 'c', 'd', 'e'])
ser2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [65]:
serie3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,2,4])
serie3

0      blue
2    purple
4    yellow
dtype: object

In [69]:
serie3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [71]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
        index=['a', 'c', 'd'],
        columns=['Ohio','Texas', 'California'])
frame
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [72]:
states = ['Texas', 'Utah', 'California']
frame2.reindex(columns=states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [76]:
new_serie = pd.DataFrame(np.arange(16).reshape((4,4)),
       index=['Ohio', 'Colorado', 'Utah', 'New York'],
       columns=['a', 'b', 'c', 'd'] )

In [77]:
new_serie = serie.drop('c')
new_serie

d    4.5
b    7.2
a   -5.3
dtype: float64

In [81]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
       index=['Ohio', 'Colorado', 'Utah', 'New York'],
       columns=['one', 'two', 'three', 'four'] )
print(data)
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [80]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [82]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [83]:
#inplace altera o DataFrame original
data.drop('Utah', inplace=True)
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [84]:
serie = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
serie
print(serie['b'])
print(serie[1])
print(serie[['b', 'a', 'd']])
print(serie[[1,3]])
print(serie[serie < 2])
#Fatiamento
print(serie['b':'c'])
serie['b':'c'] = 5
serie

1.0
1.0
b    1.0
a    0.0
d    3.0
dtype: float64
b    1.0
d    3.0
dtype: float64
a    0.0
b    1.0
dtype: float64
b    1.0
c    2.0
dtype: float64

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [86]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one','two','three','four'])
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [88]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [89]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [90]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [92]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [94]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [95]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [96]:
data.iloc[:,:3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [97]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
print(ser2)
print(ser2[-1])

a    0.0
b    1.0
c    2.0
dtype: float64
2.0

In [98]:
serie1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
serie2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f','g'])
print(serie1)
print(serie2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64
a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [100]:
serie1 + serie2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [101]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),
        columns=list('bcd'),
        index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4,3)),
        columns=list('bde'),
        index=['Utah','Ohio', 'Texas', 'Oregon'])
print(df1)
print(df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [102]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [107]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
    columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
    columns=list('abcde'))
df2.loc[1,'b'] = np.nan
print(df1)
print(df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0
      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [108]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [110]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [111]:
df2.add(df1, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [112]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [113]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [114]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [115]:
arr = np.arange(12.).reshape((3,4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [116]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), 
        columns=list('bde'), 
        index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [117]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [118]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [119]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [120]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [123]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), 
        index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.073720  0.114808 -2.201714
Ohio   -0.414744 -1.461026 -0.479485
Texas  -0.033399  0.630825 -0.408400
Oregon  0.403569  0.242080 -1.484529

In [124]:
np.abs(frame)

               b         d         e
Utah    0.073720  0.114808  2.201714
Ohio    0.414744  1.461026  0.479485
Texas   0.033399  0.630825  0.408400
Oregon  0.403569  0.242080  1.484529

In [125]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), 
        index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.776109  0.176669  0.336983
Ohio    0.565488  0.084896  0.249485
Texas  -0.366419 -1.093739  0.848273
Oregon  0.356683  1.036991 -0.090242

In [126]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.142528
d    2.130730
e    0.938515
dtype: float64

In [127]:
frame.apply(f, axis="columns")

Utah      0.599440
Ohio      0.480593
Texas     1.942012
Oregon    1.127234
dtype: float64

In [128]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah     0.78   0.18   0.34
Ohio     0.57   0.08   0.25
Texas   -0.37  -1.09   0.85
Oregon   0.36   1.04  -0.09

In [131]:
ser = pd.Series(range(4), index=['d','a','b','c'])
ser.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [132]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), 
        index=['three', 'one'], 
        columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [133]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [134]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [135]:
ser = pd.Series([4, 7, -3, 2])
ser.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [136]:
frame.sort_values(by='b')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [137]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [138]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 
        'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [139]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [140]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [142]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
print(obj)
print(obj.index.is_unique)

a    0
a    1
b    2
b    3
c    4
dtype: int64
False

In [143]:
print(obj['a'])

a    0
a    1
dtype: int64

In [144]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df.loc['b']

          0         1         2
b -0.069352 -0.034560 -1.208055
b  1.510643 -0.120015 -1.019646

In [145]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], 
                  [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'], 
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [146]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [147]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [148]:
df.mean(axis="columns", skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [149]:
df.idxmax()

one    b
two    d
dtype: object

In [150]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [151]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [152]:
import pandas_datareader.data as web 
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']} 
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()}) 
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [153]:
price.describe()

              AAPL          IBM         MSFT         GOOG
count  1259.000000  1259.000000  1259.000000  1259.000000
mean     47.741655   128.107040   102.980945  1060.125452
std      23.520580    11.050759    49.046275   247.843434
min      21.165979    92.307220    44.939899   668.260010
25%      31.340545   122.866646    60.521696   819.109985
50%      41.950378   129.366455    93.434364  1070.079956
75%      53.950016   134.313881   135.077278  1207.505005
max     133.948898   155.360657   231.649994  1763.369995

In [155]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-11-02 -0.000827  0.011195 -0.000691  0.003097
2020-11-03  0.015354  0.011071  0.020264  0.014871
2020-11-04  0.040837 -0.019797  0.048249  0.059944
2020-11-05  0.035494  0.025648  0.031887  0.008141
2020-11-06 -0.001136 -0.006361  0.001926 -0.000919

In [158]:
print(returns['MSFT'].corr(returns['IBM']))
print(returns['MSFT'].cov(returns['IBM']))

print(returns.corrwith(returns.IBM))
print(returns.corrwith(volume))

print(returns.corrwith(returns.IBM))
print(returns.corrwith(volume))

0.569485783390246
0.0001611960909899738
AAPL    0.483570
IBM     1.000000
MSFT    0.569486
GOOG    0.525197
dtype: float64
AAPL   -0.096466
IBM    -0.080754
MSFT   -0.095919
GOOG   -0.162653
dtype: float64
AAPL    0.483570
IBM     1.000000
MSFT    0.569486
GOOG    0.525197
dtype: float64
AAPL   -0.096466
IBM    -0.080754
MSFT   -0.095919
GOOG   -0.162653
dtype: float64